10/data/attachments/e522a0b026509db.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_dc85437c-9bba-43d5-9f74-b4dffd5b443a</nif:username>
            <nif:friendToBeAdded>Ashley_program_Friend_82619_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>